In [11]:
import pandas as pd
df=pd.read_csv('dataset/titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [12]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis=1,inplace=True)

In [13]:
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [14]:
target=df.Survived
inputs=df.drop('Survived',axis=1)

In [15]:
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [16]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [17]:
inputs=pd.concat([inputs,dummies],axis=1)
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [18]:
inputs.drop(['Sex'],axis=1,inplace=True)

In [19]:
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [24]:
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [23]:
inputs.Age.isnull().sum()

0

In [22]:
inputs.Age.fillna(inputs.Age.mean(),inplace=True)

In [25]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(inputs,target,test_size=0.2)

In [26]:
from sklearn.naive_bayes import GaussianNB
model= GaussianNB()

In [27]:
model.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [28]:
model.score(X_test,y_test)

0.8044692737430168

In [33]:
prob=model.predict_proba(X_test[:10])

In [34]:
prob

array([[0.98790888, 0.01209112],
       [0.06660632, 0.93339368],
       [0.05954605, 0.94045395],
       [0.91565961, 0.08434039],
       [0.98791012, 0.01208988],
       [0.03119068, 0.96880932],
       [0.04765064, 0.95234936],
       [0.9176311 , 0.0823689 ],
       [0.97385891, 0.02614109],
       [0.98740082, 0.01259918]])